Viewing ACLs

Commands:

R1# show access-lists ?
R1# show run | include interface|access

Explanation:
- show access-lists ?: This command shows the available options for displaying access lists.
- show run | include interface|access: This command filters the running configuration to display only lines containing "interface" or "access," helping you quickly find interface and access-list configurations.

Removing ACLs

R1(config)# interface s0/0/0
R1(config-if)# no ip access-group 11 out
R1(config)# no access-list 11

Explanation:
- interface s0/0/0: Enter interface configuration mode for interface `s0/0/0`.
- no ip access-group 11 out: Remove the association of access list `11` from outgoing traffic on this interface.
- no access-list 11: Delete access list `11` from the router.

Permit ACLs

R1(config)# access-list 10 permit host 192.168.10.10
R1(config)# access-list 11 permit any

Explanation:
- access-list 10 permit host 192.168.10.10: Add a rule to access list 10 to permit traffic from the specific host 192.168.10.10.
- access-list 11 permit any: Add a rule to access list 11 to permit traffic from any source.

Extended ACL Configuration

R1(config)# access-list 100 permit tcp 192.168.10.0 0.0.0.255 any eq www

Explanation:
- access-list 100 permit tcp 192.168.10.0 0.0.0.255 any eq www: Add a rule to extended access list `100` to permit TCP traffic from the `192.168.10.0/24` network to any destination on port `80` (HTTP).

Named Extended ACLs

R1(config)# ip access-list extended SURFING
R1(config-ext-nacl)# permit tcp 192.168.10.0 0.0.0.255 any eq 443
R1(config-ext-nacl)# exit
R1(config)# interface g0/0/0
R1(config-if)# ip access-group SURFING in
R1(config-if)# end

Explanation:
- ip access-list extended SURFING: Create a named extended ACL called SURFING.
- permit tcp 192.168.10.0 0.0.0.255 any eq 443: Permit TCP traffic from the `192.168.10.0/24` network to any destination on port 443 (HTTPS).
- interface g0/0/0: Enter interface configuration mode for g0/0/0.
- ip access-group SURFING in: Apply the `SURFING` ACL to inbound traffic on this interface.

Numbered Standard ACL Configuration

Router(config)# access-list 20 deny host 192.168.10.10
Router(config)# access-list 20 permit 192.168.10.0 0.0.0.255
Router(config)# interface g0/0/0
Router(config-if)# ip access-group 20 in

Explanation:
- access-list 20 deny host 192.168.10.10: Add a rule to standard access list `20` to deny traffic from `192.168.10.10`.
- access-list 20 permit 192.168.10.0 0.0.0.255: Permit traffic from the `192.168.10.0/24` network.
- interface g0/0/0: Enter interface configuration mode for `g0/0/0`.
- ip access-group 20 in: Apply the `20` ACL to inbound traffic on this interface.

Named Standard ACL Configuration

R1(config)# ip access-list standard LAN2-FILTER
R1(config-std-nacl)# permit host 192.168.10.10
R1(config-std-nacl)# deny any
R1(config-std-nacl)# exit
R1(config-if)# ip access-group LAN2-FILTER out
R1(config-if)# exit

Explanation:
- ip access-list standard LAN2-FILTER: Create a named standard ACL called LAN2-FILTER.
- permit host 192.168.10.10: Permit traffic from the specific host `192.168.10.10`.
- deny any: Deny traffic from any source.
- ip access-group LAN2-FILTER out: Apply the `LAN2-FILTER` ACL to outbound traffic on the current interface.

Editing ACLs

R1(config)# no access-list 1
R1(config)# access-list 1 deny 192.168.10.10
R1(config)# access-list 1 permit 192.168.10.0 0.0.0.255

Explanation:
- no access-list 1: Delete access list 1.
- access-list 1 deny 192.168.10.10: Create a new rule to deny traffic from `192.168.10.10`.
- access-list 1 permit 192.168.10.0 0.0.0.255: Create a new rule to permit traffic from the `192.168.10.0/24` network.

Numbered Extended ACL Protocols and Port Numbers Configuration

R1(config)# access-list 100 permit tcp any any eq www
R1(config)# access-list 100 permit tcp any any eq 80
R1(config)# access-list 100 permit tcp any any eq 22
R1(config)# access-list 100 permit tcp any any eq 443
R1(config)# access-list 110 permit tcp 192.168.10.0 0.0.0.255 any eq www
R1(config)# access-list 110 permit tcp 192.168.10.0 0.0.0.255 any eq 443
R1(config)# interface g0/0/0
R1(config-if)# ip access-group 110 in
R1(config-if)# exit

Explanation:
- access-list 100 permit tcp any any eq www: Permit TCP traffic from any source to any destination on port 80 (HTTP).
- access-list 100 permit tcp any any eq 22: Permit TCP traffic from any source to any destination on port 22 (SSH).
- access-list 100 permit tcp any any eq 443: Permit TCP traffic from any source to any destination on port 443 (HTTPS).
- access-list 110 permit tcp 192.168.10.0 0.0.0.255 any eq www: Permit TCP traffic from the `192.168.10.0/24` network to any destination on port 80.
- access-list 110 permit tcp 192.168.10.0 0.0.0.255 any eq 443: Permit TCP traffic from the `192.168.10.0/24` network to any destination on port `443`.
- interface g0/0/0: Enter interface configuration mode for g0/0/0.
- ip access-group 110 in: Apply the 110 ACL to inbound traffic on this interface.

TCP Established Extended ACL

R1(config)# access-list 120 permit tcp any 192.168.10.0 0.0.0.255 established
R1(config)# interface g0/0/0 
R1(config-if)# ip access-group 120 out 
R1(config-if)# end

Explanation:
- access-list 120 permit tcp any 192.168.10.0 0.0.0.255 established: Permit TCP traffic from any source to the `192.168.10.0/24` network if the connection is already established.
- interface g0/0/0: Enter interface configuration mode for g0/0/0.
- ip access-group 120 out: Apply the 120 ACL to outbound traffic on this interface.
